---
kind: property
id: P:Autodesk.Revit.DB.ImageExportOptions.ShouldCreateWebSite
source: html/e7f6b59a-2846-8036-8ff6-718e9d83062b.htm
---
# Autodesk.Revit.DB.ImageExportOptions.ShouldCreateWebSite Property

Whether or not to create a web site with a page for each export. Used only when ExportRange is SetOfViews.

## Syntax (C#)
```csharp
public bool ShouldCreateWebSite { get; set; }
```

## Remarks
The default is false.
 This field is ignored if used to save an image to a project as a new view.